{
  "cache_ordered": [
    [
      "0499adce8ab2c0c94fb1d5083776c574",
      {
        "url": "https://nas.er.usgs.gov/queries/FactSheet.aspx?speciesID=3243",
        "content": "Title: clown anemonefish (Amphiprion ocellaris) - Species Profile\n\nURL Source: https://nas.er.usgs.gov/queries/FactSheet.aspx?speciesID=3243\n\nMarkdown Content:\n*   ![Image 1: Amphiprion ocellaris](https://nas.er.usgs.gov/XIMAGESERVERX/2018/20180814081341.jpg)\n\nJack Randall, Bishop Museum![Image 2: Copyright Info](https://nas.er.usgs.gov/images/copyright-questionmark-small.png)\n\n_Amphiprion ocellaris_ Cuvier in Cuvier and Valenciennes, 1830\n\nCommon name: clown anemonefish\n\nSynonyms and Other Names: common clownfish, false clown anemonefish, false percula clownfish, clownfish, anemonefish\n\nTaxonomy: available through www.itis.gov[![Image 3: ITIS logo](https://nas.er.usgs.gov/queries/images/ITISlogo.jpg)](http://www.itis.gov/servlet/SingleRpt/SingleRpt?search_topic=TSN&search_value=615174)\n\nIdentification: There are 30 species of _Amphiprion_ (Eschmeyer et al. 2018) with color pattern being the most important feature for identification (Fautin and Allen 1992). The more common species in the pet trade, _A. ocellaris_ and _A. percula_, are orange with three white bars. The middle bar has a forward-projecting bulge with variable amounts of black edging on bars (Allen et al. 2003). _Amphiprion ocellaris_ can be distinguished from _A. percula_ by having a higher dorsal fin with 11 dorsal fin spines compared to 10 (rarely 9) spines of _A. percula_ (Fautin and Allen 1992).\n\nSize: Maximum length 90 mm TL (Fautin and Allen 1992)\n\nNative Range: Indo-Pacific Ocean, tropical marine habitat associated with rocky or coral reefs to 15 m (Allen et al. 2003)\n\n[Nonindigenous Occurrences](https://nas.er.usgs.gov/queries/CollectionInfo.aspx?SpeciesID=3243 \"Collection Information Available\"): One individual identified as Amphiprion ocellaris was collected in July 2018 in Fred Howard Park, Pinellas Co., **Florida**\nTable 1. States with nonindigenous occurrences, the earliest and latest observations in each state, and the tally and names of [HUCs](https://nas.er.usgs.gov/hucs.aspx) with observations†. Names and dates are hyperlinked to their relevant specimen records. The list of references for all nonindigenous occurrences of _Amphiprion ocellaris_ are found [here](https://nas.er.usgs.gov/queries/references/ReferenceList.aspx?genus=Amphiprion&species=ocellaris).\n\n| [State](https://nas.er.usgs.gov/queries/FactSheet.aspx?speciesID=3243#) | [First Observed](https://nas.er.usgs.gov/queries/FactSheet.aspx?speciesID=3243#) | [Last Observed](https://nas.er.usgs.gov/queries/FactSheet.aspx?speciesID=3243#) | [Total HUCs with observations†](https://nas.er.usgs.gov/queries/FactSheet.aspx?speciesID=3243#) | HUCs with observations† |\n| --- | --- | --- | --- | --- |\n| [FL](https://nas.er.usgs.gov/queries/CollectionInfo.aspx?SpeciesID=3243&State=FL) | [2018](https://nas.er.usgs.gov/queries/CollectionInfo.aspx?SpeciesID=3243&State=FL&YearFrom=2018&YearTo=2018) | [2018](https://nas.er.usgs.gov/queries/CollectionInfo.aspx?SpeciesID=3243&State=FL&YearFrom=2018&YearTo=2018) | 1 | [Crystal-Pithlachascotee](https://nas.er.usgs.gov/queries/CollectionInfo.aspx?SpeciesID=3243&State=FL&HUCNumber=03100207) |\n\nTable last updated 1/13/2026\n\n† Populations may not be currently present.\n\nEcology: Clownfish live within the tentacles of sea anemones. About one-third of the species live with a host-specific species of anemone (Allen et al. 2003). They are highly territorial, forming a symbiotic relationship with anemones. A protective layer of mucus on the fish prevents it from being stung while it takes refuge amongst the tentacles. The aggressive nature of the fish provides protection for the anemone from predators, primarily butterflyfishes (Fautin and Allen 1992, Randall 2005). These fish form monogamous pairs, sharing an anemone with a few subordinate non-breeding non-related individuals (Fricke and Fricke 1977). _Amphiprion_ are protandrous hermaphrodites which means all fish begin as males with the ability to change into females as they grow older (Randall 2005). Females are the largest and dominant member of the pair. If the female is removed, the male will change into a female and the dominant subordinate will mature. (Randall 2005). Eggs are laid on the anemone and tended by the male (Fautin and Allen 1992). Most clownfishes feed on zooplankton, copepods, larval tunicates, and bits of algae (Allen et al. 2003).\n\nMeans of Introduction: Probable aquarium release\n\nStatus: Eradicated. Specimen was removed alive and transferred to the Clearwater Marine Aquarium.\n\nImpact of Introduction: The impacts of this species are currently unknown, as no studies have been done to determine how it has affected ecosystems in the invaded range. The absence of data does not equate to lack of effects. It does, however, mean that research is required to evaluate effects before conclusions can be made.\n\nRemarks: Clown anemone fish are popular in the aquarium trade. They are among the top aquarium fish imported by volume to the United States (Rhyne et al. 2012) and are one of the most commonly-cultured marine species (DiMaggio et al. 2017).\n\n[References](https://nas.er.usgs.gov/queries/references/ReferenceListCutPaste.aspx?speciesID=3243)**:**(click for full references)\n\nAllen, G.R., Steene, R., Humann, P., and Deloach, N. 2003. Reef Fish Identification: Tropical Pacific. New World Publications Incorporated. Jacksonville, FL. 458 p.\n\nDiMaggio, M.A., Groover, E.M., van Senten, J., and Schwarz, M. 2017. Species profile: Clownfish. SRAC Publication No. 7213. Southern Regional Aquaculture Center, Stoneville, Mississippi.\n\nEschmeyer, W.N. Fricke, R., and van der Laan, R. 2018. Catalog of Fishes. http://www.calacademy.org/scientists/projects/catalog-of-fishes [accessed 24 July 2018].\n\nFautin, D.G. and Allen G.R. 1992. Field Guide to Anemone Fishes and Their Host Anemonies. Western Australia Museum, Perth, Australia.\n\nFricke, H. and Fricke, S. 1977. Monogamy and sex change by aggressive dominance in coral reef fish. Nature 266:830-832.\n\nRandall, J.E. 2005. Reef and Shore Fishes of the South Pacific: New Caledonia to Tahiti and the Pitcairn Islands. University of Hawai’i Press, Honolulu. 707 p.\n\nRhyne, A.L., M.F. Tlusty, P.J. Schofield, L. Kaufman, J.A. Morris, Jr., and A.W. Bruckner. 2012. Revealing the appetite of the marine aquarium fish trade: the volume and biodiversity of fish imported into the United States. PLoS ONE 7(5): e35808.\n\nOther Resources: \n\n[](https://nas.er.usgs.gov/queries/FactSheet.aspx?speciesID=3243)\n\n**Revision Date:**5/24/2019\n\n**Peer Review Date:**5/24/2019\n\n**Citation Information:**\n\nBrown, M.E. and Schofield, P. J., 2026, _Amphiprion ocellaris_ Cuvier in Cuvier and Valenciennes, 1830: U.S. Geological Survey, Nonindigenous Aquatic Species Database, Gainesville, FL, https://nas.er.usgs.gov/queries/FactSheet.aspx?speciesID=3243, Revision Date: 5/24/2019, Peer Review Date: 5/24/2019, Access Date: 1/14/2026\n\n[![Image 4: NS Logo](https://nas.er.usgs.gov/queries/images/NatureServe_logo.png)](http://www.natureserve.org/)\n\nThis information is preliminary or provisional and is subject to revision. It is being provided to meet the need for timely best science. The information has not received final approval by the U.S. Geological Survey (USGS) and is provided on the condition that neither the USGS nor the U.S. Government shall be held liable for any damages resulting from the authorized or unauthorized use of the information.\n",
        "timestamp": 1768381885.9369721
      }
    ]
  ],
  "stats": {
    "hits": 0,
    "misses": 0,
    "evictions": 0
  },
  "max_size": 10000,
  "saved_at": 1768384114.8956342
}